In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
from numpy import nan

In [3]:
data = Series(['one', 'two', nan, 'four'])

In [4]:
data

0     one
1     two
2     NaN
3    four
dtype: object

In [5]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [7]:
df = DataFrame([[1,2,3], [nan,5,6],[nan,nan,nan]])

In [8]:
df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  NaN  NaN  NaN

In [9]:
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [10]:
df.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0

In [11]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [12]:
df.fillna(1)

     0    1    2
0  1.0  2.0  3.0
1  1.0  5.0  6.0
2  1.0  1.0  1.0

In [13]:
# 列ごとに埋める値を変える
df.fillna({0:0, 1:1, 2:2})

     0    1    2
0  1.0  2.0  3.0
1  0.0  5.0  6.0
2  0.0  1.0  2.0

In [14]:
# 破壊的変更
df.fillna(0, inplace=True)

In [15]:
df

     0    1    2
0  1.0  2.0  3.0
1  0.0  5.0  6.0
2  0.0  0.0  0.0